avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/basic_sample/src/smc_gen/r_gpio_rx/src/r_gpio_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2013-2021 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_gpio_rx.c
* Description  : General Purpose Input/Output driver for RX MCUs.
***********************************************************************************************************************/
/***********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 17.07.2013 1.00    First Release
*         : 21.11.2014 1.40    Added support for RX113
*         : 02.09.2015 1.50    Added support for RX71M
*         :                    Modified R_GPIO_PinControl to accept GPIO_CMD_DSCR_ENABLE/_DISABLE commands.
*         : 01.10.2016 2.10    Added support for RX65N
*         :                    Modified R_GPIO_PinControl to accept GPIO_CMD_DSCR2_ENABLE/_DISABLE commands.
*         : 19.12.2016 2.20    Added support for RX24U, RX24T(512KB)
*         : 21.07.2017 2.30    Added support for RX65N-2M, RX130-512KB.
*         : 28.09.2018 2.40    Added support for RX66T.
*                              Update according to GSCE Code Checker
*         : 01.02.2019 2.50    Added support for RX72T, RX65N-64pin
*                              Update according to GSCE Code Checker
*         : 20.05.2019 3.00    Added support for GNUC and ICCRX.
*         : 28.06.2019 3.10    Added support RX23W
*         : 15.08.2019 3.20    Added support RX72M
*         : 25.11.2019 3.30    Added support RX13T
*                              Modified comment of API function to Doxygen style.
*         : 30.12.2019 3.40    Added support RX72N, RX66N.
*         : 15.04.2021 4.10    Updated Doxygen comment.
*         : 11.11.2021 4.30    Update according to GSCE Code Checker 6.00
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include "platform.h"
/* Public interface header file for this package. */
#include "r_gpio_rx_if.h"
/* Configuration for this package. */
#include "r_gpio_rx_config.h"

/***********************************************************************************************************************
* Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
* Typedef definitions
***********************************************************************************************************************/
/* Different pin output options. */
typedef enum
{
    GPIO_PIN_OUT_CMOS              = 0,
    GPIO_PIN_OUT_OPEN_DRAIN_N_CHAN = 1,
    GPIO_PIN_OUT_OPEN_DRAIN_P_CHAN = 2
} gpio_pin_output_t;

/***********************************************************************************************************************
* Private global variables and functions
***********************************************************************************************************************/
uint8_t volatile * gpio_port_addr_get(uint8_t volatile * base_addr, uint16_t index);
bool               gpio_pin_function_check(uint8_t const * check_array, uint8_t port_number, uint8_t pin_number);
void               gpio_set_output_type(gpio_port_pin_t pin, gpio_pin_output_t out_type);

/***********************************************************************************************************************
* Export global variables
***********************************************************************************************************************/
#if (GPIO_CFG_PARAM_CHECKING_ENABLE == 1)
    extern const uint8_t g_gpio_open_drain_n_support[];
    extern const uint8_t g_gpio_open_drain_p_support[];
    extern const uint8_t g_gpio_pull_up_support[];
    #if defined (GPIO_DSCR_IS_SUPPORTED)
        extern const uint8_t g_gpio_dscr_support[];
    #endif
    #if defined (GPIO_DSCR2_IS_SUPPORTED)
        extern const uint8_t g_gpio_dscr2_support[];
    #endif
#endif

/***********************************************************************************************************************
* Function Name: R_GPIO_PortWrite
********************************************************************************************************************//**
* @brief This function writes the levels of all pins on a port.
* @param[in] port -  Which port to write to. See Section 2.10.1, Ports.
* @param[in] value - The value to write to the port. Each bit corresponds to a pin on the port (e.g. bit 0 of value
* will be written to pin 0 on supplied port)
* @details The input value will be written to the specified port. Each bit in the value parameter corresponds to a pin
* on the port. For example, bit 7 of write value corresponds to pin 7, bit 6 corresponds to pin 6, and so forth.
* @note In the interest of performance, this function does not automatically check for non-existent pins when the
* port-wide write function is called. It is up to the user’s application to insure that only valid pins are written to.
*
*/
void R_GPIO_PortWrite (gpio_port_t port, uint8_t value)
{
    uint8_t volatile * podr;

