avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/basic_sample/src/smc_gen/r_gpio_rx/src/r_gpio_rx.c
    /* PODR register addresses are incremental in memory starting with PORT0.PODR. Even if a port is not available
     * on this MCU, the address is reserved. */
    /* Get register address. */
    podr = gpio_port_addr_get(GPIO_PRV_BASE_ADDR_OUTPUT, (uint16_t)port);

    /* Write to the selected port. */
    *podr = value;
} /* End of function R_GPIO_PortWrite */

/***********************************************************************************************************************
* Function Name: R_GPIO_PortRead
********************************************************************************************************************//**
* @brief This function reads the levels of all pins on a port.
* @param[in] port - Which port to read. See Section 2.10.1, Ports.
* @return The value of the port.
* @details The specified port will be read, and the levels for all the pins will be returned. Each bit in the returned
* value corresponds to a pin on the port. For example, bit 7 of read value corresponds to pin 7, bit 6 corresponds to
* pin 6, and so forth.
*/
uint8_t R_GPIO_PortRead (gpio_port_t port)
{
    /* PIDR register addresses are incremental in memory starting with PORT0.PIDR. Even if a port is not available
     * on this MCU, the address is reserved. */

    /* Read the selected port. */
    return *gpio_port_addr_get(GPIO_PRV_BASE_ADDR_INPUT, (uint16_t)port);
} /* End of function R_GPIO_PortRead */

/***********************************************************************************************************************
* Function Name: R_GPIO_PortDirectionSet
********************************************************************************************************************//**
* @brief This function sets multiple pins on a port to inputs or outputs at once.
* @param[in] port - Which port to use. See Section 2.10.1, Ports.
* @param[in] dir - Which direction to use. See Section 2.10.5, Pin Direction.
* @param[in] mask - Mask of which pins to change. 1 = set direction, 0 = do not change.
* @details Multiple pins on a port can be set to inputs or outputs at once. Each bit in the mask parameter corresponds
* to a pin on the port. For example, bit 7 of mask corresponds to pin 7, bit 6 corresponds to pin 6, and so forth.
* If a bit is set to 1 then the corresponding pin will be changed to an input or output as specified by the dir
* parameter. If a bit is set to 0 then the direction of the pin will not be changed.
* @note This function does not allow the user to specify the use of special modes such as input pull-up resistors or
* open-drain outputs. To enable these modes use the R_GPIO_PinControl() function.
*/
void R_GPIO_PortDirectionSet (gpio_port_t port, gpio_dir_t dir, uint8_t mask)
{
    uint8_t volatile * pdr;

    /* PDR register addresses are incremental in memory starting with PORT0.PDR. Even if a port is not available
     * on this MCU, the address is reserved. */
    /* Get register address. */
    pdr = gpio_port_addr_get(GPIO_PRV_BASE_ADDR_DIRECTION, (uint16_t)port);

    /* Write to the selected register. & or | based on direction. */
    if (GPIO_DIRECTION_INPUT == dir)
    {
        /* Set value to port */
        *pdr = (uint8_t)((*pdr) & (~mask));
    }
    else
    {
        /* Set value to port */
        *pdr = (uint8_t)((*pdr) | mask);
    }
} /* End of function R_GPIO_PortDirectionSet */

/***********************************************************************************************************************
* Function Name: R_GPIO_PinWrite
********************************************************************************************************************//**
* @brief This function sets the level of a pin.
* @param[in] pin - Which pin to use. See Section 2.10.2, Pins.
* @param[in] level - What level to set the pin to.
* @details Pins can either be set as high (‘1’) or low (‘0’).
*/
void R_GPIO_PinWrite (gpio_port_pin_t pin, gpio_level_t level)
{
    uint8_t volatile * podr;

    /* PODR register addresses are incremental in memory starting with PORT0.PODR. Even if a port is not available
     * on this MCU, the address is reserved. */
    /* Get register address. */
    podr = gpio_port_addr_get(GPIO_PRV_BASE_ADDR_OUTPUT, (uint16_t)pin);

    /* Write to the selected bit. & or | based on direction. */
    if (GPIO_LEVEL_LOW == level)
    {
        /* Set value to port */
        *podr = (uint8_t)((*podr) & (~(1 << (pin & 0x00FFu))));
    }
    else
    {
        /* Set value to port */
        *podr = (uint8_t)((*podr) | (1 << (pin & 0x00FFu)));
    }
} /* End of function R_GPIO_PinWrite */

/***********************************************************************************************************************
* Function Name: R_GPIO_PinRead
********************************************************************************************************************//**
* @brief This function reads the level of a pin.
* @param[in] pin - Which pin to use. See Section 2.10.2, Pins.
* @return The level of the specified pin.
* @details The specified pin will be read and the level returned.
*/
gpio_level_t R_GPIO_PinRead (gpio_port_pin_t pin)
{
    uint8_t volatile * pidr;

    /* PIDR register addresses are incremental in memory starting with PORT0.PODR. Even if a port is not available
     * on this MCU, the address is reserved. */
    /* Get register address. */
    pidr = gpio_port_addr_get(GPIO_PRV_BASE_ADDR_INPUT, (uint16_t)pin);

    /* Mask to get the individual bit. */
    if (((*pidr) & (1 << (pin & 0x00FFu))) != 0)
    {
        return GPIO_LEVEL_HIGH;
    }
    else
    {
        return GPIO_LEVEL_LOW;
    }
} /* End of function R_GPIO_PinRead */

/***********************************************************************************************************************
* Function Name: R_GPIO_PinDirectionSet
********************************************************************************************************************//**
* @brief This function sets the direction (input/output) of a pin.
* @param[in] pin - Which pin to use. See Section 2.10.2, Pins.
* @param[in] dir - Which direction to use for this pin. See Section 2.10.5, Pin Direction.
* @details This function sets pins as inputs or outputs. For enabling other settings such as open-drain outputs or
* internal pull-ups see the R_GPIO_PinControl() function.
*/
void R_GPIO_PinDirectionSet (gpio_port_pin_t pin, gpio_dir_t dir)
{
    uint8_t volatile * pdr;

    /* PDR register addresses are incremental in memory starting with PORT0.PDR. Even if a port is not available
     * on this MCU, the address is reserved. */
    /* Get register address. */
    pdr = gpio_port_addr_get(GPIO_PRV_BASE_ADDR_DIRECTION, (uint16_t)pin);

